English/other/English for Everyday Activities/01 First thing in the morning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-14 Thu 17:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org55f8431" class="outline-2">
<h2 id="org55f8431">01 First thing in the morning</h2>
<div class="outline-text-2" id="text-org55f8431">
<p class="verse">
Dan's alarm clock rings and he wakes up.<br />
He gets out of bed.<br />
He goes into the bathroom.<br />
<br />
After using the toilet and flushing it, he washes his hands.<br />
He brushes his teeth, shaves, and takes a shower.<br />
He dries himself off with a towel.<br />
Then he brushes his hair.<br />
He gets dressed.<br />
He makes breakfast and eats it.<br />
The he leaves the apartment.<br />
</p>
</div>
<div id="outline-container-orgb8c38bc" class="outline-3">
<h3 id="orgb8c38bc">expression</h3>
<div class="outline-text-3" id="text-orgb8c38bc">
<p>
bathroom [ˈbæθˌrum]: n. a room where there is a bath or ↑shower, a ↑basin, and sometimes a toilet浴室<br />
toilet [ˈtɔɪlət]: n. a large bowl that you sit on to get rid of waste liquid or waste matter from your body抽水马桶<br />
flush [flʌʃ]: v. if you flush a toilet, or if it flushes, you make water go through it to clean it冲洗<br />
wash [wɑʃ]: v. to clean something using water and a type of soap洗<br />
brush [brʌʃ]: v. an object that you use for cleaning, painting, making your hair tidy etc, made with a lot of hairs, ↑bristles, or thin pieces of plastic, fastened to a handle ⇨ broom刷, 掸, 拂<br />
shave [ʃeɪv]: v. to cut off hair very close to the skin, especially from the face, using a ↑razor剃, 刮<br />
</p>
<hr />
<p>
alarm clock: 闹钟<br />
get out of bed: 起床<br />
dry sb./sth. off: 烘干,弄干某人某物<br />
get dressed: 穿衣服<br />
make breakfast/lunch/dinner: 做早餐<br />
</p>
</div>
</div>
<div id="outline-container-org99eeb86" class="outline-3">
<h3 id="org99eeb86">sentence</h3>
<div class="outline-text-3" id="text-org99eeb86">
<p>
bathroom [ˈbæθˌrum]: n. a room where there is a bath or ↑shower, a ↑basin, and sometimes a toilet浴室<br />
</p>
<ul class="org-ul">
<li>Who's in the bathroom?<br /></li>
<li>It is in the bathroom that you murdered your wife who was taking a shower.<br /></li>
<li>My cat is forbidden to enter in the bathroom.<br /></li>
</ul>
<p>
toilet [ˈtɔɪlət]: n. a large bowl that you sit on to get rid of waste liquid or waste matter from your body抽水马桶<br />
</p>
<ul class="org-ul">
<li>The cute boy fed his father with a cup of water which was from the toilet.<br /></li>
<li>My wife is complaining that I messed up the toilet over and over again.<br /></li>
<li>When Taiwanese actors come to the mainland, they always complain about the dirty toilets.<br /></li>
</ul>
<p>
flush [flʌʃ]: v. if you flush a toilet, or if it flushes, you make water go through it to clean it冲洗<br />
</p>
<ul class="org-ul">
<li>I do think the cask needs flushing now.<br /></li>
<li>If you hadn't forgotten to flush the barrel, we wouldn't have been punished by our master.<br /></li>
<li>I am flushing the toilet under the command of our boss.<br /></li>
</ul>
<p>
wash [wɑʃ]: v. to clean something using water and a type of soap洗<br />
</p>
<ul class="org-ul">
<li>Obviously, he has a difficult time in washing his hands full of a special kind of grease.<br /></li>
<li>On hitting my hands bitterly, my father began to wash my mud-filled hands.<br /></li>
<li>We call for your washing hands before you perform experiments in our laboratory.<br /></li>
</ul>
<p>
brush [brʌʃ]: v. an object that you use for cleaning, painting, making your hair tidy etc, made with a lot of hairs, ↑bristles, or thin pieces of plastic, fastened to a handle ⇨ broom刷, 掸, 拂<br />
</p>
<ul class="org-ul">
<li>My wife spent half a morning brushing my desktop when we moved to our new house.<br /></li>
<li>The man is brushing his precious car with great care.<br /></li>
<li>If you brush my back, I will reward you with 1 yuan. My grandfather used to say that to me.<br /></li>
</ul>
<p>
shave [ʃeɪv]: v. to cut off hair very close to the skin, especially from the face, using a ↑razor剃, 刮<br />
</p>
<ul class="org-ul">
<li>My wife pointed at my face pointing out that I forgot to shave in the morning.<br /></li>
<li>In fact, we are capable to shave our cat without hurting her.<br /></li>
<li>People in the community are appalled at the fact that someone had shaved the stray dog in the cold winter.<br /></li>
</ul>
<hr />
<p>
alarm clock: 闹钟<br />
</p>
<ul class="org-ul">
<li>Don't forget to set the alarm clock, you have a driver test tomorrow.<br /></li>
<li>Because of being late for school, the grandson of our village head asked for an alarm clock.<br /></li>
<li>No one could account for the fact that the alarm clock worth of 100 dollars has broken down.<br /></li>
</ul>
<p>
get out of bed: 起床<br />
</p>
<ul class="org-ul">
<li>I got out of bed late on Saturday feeling extremely hungry.<br /></li>
<li>When my aunt knocked at my door, I still hadn't got out of bed.<br /></li>
<li>On getting out of bed, he was given a birthday surprise when his family gathered round to celebrate it.<br /></li>
</ul>
<p>
dry sb./sth. off: 烘干,弄干某人某物<br />
</p>
<ul class="org-ul">
<li>You haven't dried your body off again, you foot is still wet.<br /></li>
<li>Dry the cup off, otherwise your stomach may turn when you drink milk.<br /></li>
<li>My wife instructed me to dry off the desktop and fill bowls with rice.<br /></li>
</ul>
<p>
get dressed: 穿衣服<br />
</p>
<ul class="org-ul">
<li>Wait for a minute, I am still getting dressed. I said in a loud voice.<br /></li>
<li>The vicious king sentenced his wife to death while getting dressed.<br /></li>
<li>The dog must have been in the possession of a master, for he gets dressed well.<br /></li>
</ul>
<p>
make breakfast/lunch/dinner: 做早餐<br />
</p>
<ul class="org-ul">
<li>Tired of making breakfast, he goes to restaurant every morning.<br /></li>
<li>Tired of making breakfast, she asked her wife to make it on his own.<br /></li>
<li>Tired of making breakfast, she lost her temper and yelled at her husband.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org41447cf" class="outline-3">
<h3 id="org41447cf">sentence2</h3>
<div class="outline-text-3" id="text-org41447cf">
<p>
bathroom [ˈbæθˌrum]: n. a room where there is a bath or ↑shower, a ↑basin, and sometimes a toilet浴室<br />
</p>
<ul class="org-ul">
<li>Who's in the bathroom?<br /></li>
<li>It is in the bathroom that you murdered your wife who was taking a shower.<br /></li>
<li>My cat is not allowed to enter the bathroom.<br /></li>
</ul>
<p>
toilet [ˈtɔɪlət]: n. a large bowl that you sit on to get rid of waste liquid or waste matter from your body抽水马桶<br />
</p>
<ul class="org-ul">
<li>The cute boy fed his father with a cup of water which was from the toilet.<br /></li>
<li>My wife is complaining that I messed up the toilet over and over again.<br /></li>
<li>When Taiwanese actors come to the mainland, they always complain about the dirty toilets.<br /></li>
</ul>
<p>
flush [flʌʃ]: v. if you flush a toilet, or if it flushes, you make water go through it to clean it冲洗<br />
</p>
<ul class="org-ul">
<li>I do think the cask needs flushing now.<br /></li>
<li>If you hadn't forgotten to flush the barrel, we wouldn't have been punished by our master.<br /></li>
<li>I am flushing the toilet under the command of our boss.<br /></li>
</ul>
<p>
wash [wɑʃ]: v. to clean something using water and a type of soap洗<br />
</p>
<ul class="org-ul">
<li>Obviously, he has a difficult time washing his hands full of a special kind of grease.<br /></li>
<li>On hitting my hands bitterly, my father began to wash my mud-filled hands.<br /></li>
<li>We call for you to wash your hands before you perform experiments in our laboratory.<br /></li>
</ul>
<p>
brush [brʌʃ]: v. an object that you use for cleaning, painting, making your hair tidy etc, made with a lot of hairs, ↑bristles, or thin pieces of plastic, fastened to a handle ⇨ broom刷, 掸, 拂<br />
</p>
<ul class="org-ul">
<li>My wife spent half a morning brushing my desktop when we moved to our new house.<br /></li>
<li>The man is brushing his precious car with great care.<br /></li>
<li>If you brush my back, I will reward you with 1 yuan. My grandfather used to say that to me.<br /></li>
</ul>
<p>
shave [ʃeɪv]: v. to cut off hair very close to the skin, especially from the face, using a ↑razor剃, 刮<br />
</p>
<ul class="org-ul">
<li>My wife pointed at my face pointing out that I forgot to shave in the morning.<br /></li>
<li>In fact, we are capable of shaving our cat without hurting her.<br /></li>
<li>People in the community are appalled at the fact that someone had shaved the stray dog in the cold winter.<br /></li>
</ul>
<hr />
<p>
alarm clock: 闹钟<br />
</p>
<ul class="org-ul">
<li>Don't forget to set the alarm clock, you have a driver test tomorrow.<br /></li>
<li>Because of being late for school, the grandson of our village head asked for an alarm clock.<br /></li>
<li>No one could account for the fact that the alarm clock worth 100 dollars has broken down.<br /></li>
</ul>
<p>
get out of bed: 起床<br />
</p>
<ul class="org-ul">
<li>I got out of bed late on Saturday feeling extremely hungry.<br /></li>
<li>When my aunt knocked at my door, I still hadn't gotten out of bed.<br /></li>
<li>On getting out of bed, he was given a birthday surprise when his family gathered around to celebrate it.<br /></li>
</ul>
<p>
dry sb./sth. off: 烘干,弄干某人某物<br />
</p>
<ul class="org-ul">
<li>You haven't dried your body off again, your foot is still wet.<br /></li>
<li>Dry the cup off, otherwise your stomach may turn when you drink milk.<br /></li>
<li>My wife instructed me to dry off the desktop and fill bowls with rice.<br /></li>
</ul>
<p>
get dressed: 穿衣服<br />
</p>
<ul class="org-ul">
<li>Wait for a minute, I am still getting dressed. I said in a loud voice.<br /></li>
<li>The vicious king sentenced his wife to death while getting dressed.<br /></li>
<li>The dog must have been in the possession of a master, for he gets dressed well.<br /></li>
</ul>
<p>
make breakfast/lunch/dinner: 做早餐<br />
</p>
<ul class="org-ul">
<li>Tired of making breakfast, he goes to the restaurant every morning.<br /></li>
<li>Tired of making breakfast, she asked her wife to make it on his own.<br /></li>
<li>Tired of making breakfast, she lost her temper and yelled at her husband.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
